src/Documents/СтатусыВыплатыПособия/СтатусыВыплатыПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтатусыВыплатыПособия</name>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ЗапросСтатусовВыплатыПособия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтрокиРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОВыплатах</name>
    <attributes>
      <name>ИдентификаторСтрокиРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРеестра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникСНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусВыплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/РегистрацииОтветовНаЗапросыФССДляРасчетаПособий/РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииОтветовНаЗапросыФССДляРасчетаПособий</name>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументаСЭДОФСС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоставкаТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Зарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияНомерПроцесса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияНомерРеестра</name>
    <comment>Пример: P_1234567890_2022_01_01_12345678_0</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрацияСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиЛогическогоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Страхователь</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьРегистрацияНомерРеестраПВСО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтправленОператору</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправкиОператору</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДоставкаИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыплатаСсылка</name>
    <type>
      <types>DocumentRef.УведомлениеОСтатусеВыплатыПособия</types>
    </type>
  </resources>
  <resources>
    <name>ВыплатаСтатус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыплатаУспех</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УведомлениеОбИзменении</name>
    <type>
      <types>DocumentRef.УведомлениеОбИзмененииРасчетаПособия</types>
    </type>
  </resources>
  <resources>
    <name>РегистрацияИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистрацияПротокол</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкиЛогическогоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИсходящийДокумент</name>
    <type>
      <types>DocumentRef.ОтветНаЗапросФССДляРасчетаПособия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СтатусыВыплатыПособия/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)
	|	И ЗначениеРазрешено(Страхователь)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область СоставДокументов

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область СЭДО

Функция РеквизитыИсходящегоДокумента(ИсходящийДокумент)
	ИменаПолей = "ФизическоеЛицо, Ссылка, ИдентификаторРеестра, ИдентификаторСтрокиРеестра";
	Если Не ЗначениеЗаполнено(ИсходящийДокумент) Тогда
		Результат = Новый Структура(ИменаПолей);
		Результат.Ссылка = ИсходящийДокумент;
		Результат.ИдентификаторРеестра = "";
		Результат.ИдентификаторСтрокиРеестра = "";
		Возврат Результат;
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходящийДокумент, ИменаПолей, Ложь);
КонецФункции

Функция СоздатьПоСообщению85(Запись, ТаблицаСведенийОВыплатах) Экспорт
	РеквизитыИсходящегоДокумента = РеквизитыИсходящегоДокумента(Запись.ИсходящийДокумент);
	
	// Определение ссылки на физическое лицо и заполнение физлица в строках таблицы.
	ФизическоеЛицо = Неопределено;
	МассивСНИЛС = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаСведенийОВыплатах, "СотрудникСНИЛС");
	КоллекцииБЗК.УдалитьПустыеЗначенияМассива(МассивСНИЛС);
	Если МассивСНИЛС.Количество() > 0 Тогда
		ТаблицаФизлиц = СЭДОФСС.ТаблицаФизлицПоСНИЛС(МассивСНИЛС);
		Для Каждого СтрокаТаблицыФизлиц Из ТаблицаФизлиц Цикл
			ФизическоеЛицо = СтрокаТаблицыФизлиц.ФизическоеЛицо;
			Фильтр = Новый Структура("СотрудникСНИЛС", СтрокаТаблицыФизлиц.СтраховойНомерПФР);
			Найденные = ТаблицаСведенийОВыплатах.НайтиСтроки(Фильтр);
			Для Каждого СтрокаТаблицы Из Найденные Цикл
				СтрокаТаблицы.ФизическоеЛицо = СтрокаТаблицыФизлиц.ФизическоеЛицо;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ФизическоеЛицо = РеквизитыИсходящегоДокумента.ФизическоеЛицо;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		НомераПроцессов = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаСведенийОВыплатах, "НомерПроцесса");
		КоллекцииБЗК.УдалитьПустыеЗначенияМассива(НомераПроцессов);
		ФизическоеЛицо = ФизическоеЛицоПоНомерамПроцессов(НомераПроцессов);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ИдентификаторыРеестров = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаСведенийОВыплатах, "ИдентификаторРеестра");
		КоллекцииБЗК.УдалитьПустыеЗначенияМассива(ИдентификаторыРеестров);
		ФизическоеЛицо = ФизическоеЛицоПоИдентификаторамРеестров(ИдентификаторыРеестров);
	КонецЕсли;
	
	ДокументОбъект = СоздатьДокументПоСообщению(Запись.Страхователь, Запись.РегистрацияИдентификатор);
	Если Не ДокументОбъект.Загружен Тогда
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Загружен = Истина;
	КонецЕсли;
	ДокументОбъект.ДатаСообщения = Запись.РегистрацияДата;
	ДокументОбъект.Страхователь = Запись.Страхователь;
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ДокументОбъект.ФизическоеЛицо = ФизическоеЛицо;
	КонецЕсли;
	ДокументОбъект.СведенияОВыплатах.Загрузить(ТаблицаСведенийОВыплатах);
	ДокументОбъект.ИсходящийДокумент = Запись.ИсходящийДокумент;
	ДокументОбъект.ИдентификаторСтрокиРеестра = РеквизитыИсходящегоДокумента.ИдентификаторСтрокиРеестра;
	ДокументОбъект.ИдентификаторРеестра = РеквизитыИсходящегоДокумента.ИдентификаторРеестра;
	ДокументОбъект.ТекстОшибки = Запись.РегистрацияТекстОшибки;
	
	РежимЗаписи = ?(ДокументОбъект.ПометкаУдаления, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение);
	СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, "БЗК", РежимЗаписи);
	Возврат ДокументОбъект;
КонецФункции

Функция СоздатьДокументПоСообщению(Страхователь, ИдентификаторСообщения)
	НастройкиЗапроса = ЗапросыБЗК.НастройкиЗапросаКТаблице();
	НастройкиЗапроса.Количество = 1;
	ЗапросыБЗК.ДобавитьОтбор(НастройкиЗапроса.Отбор, "ИдентификаторСообщения", , ИдентификаторСообщения);
	ЗапросыБЗК.ДобавитьОтбор(НастройкиЗапроса.Отбор, "Страхователь",           , Страхователь);
	Запрос = ЗапросыБЗК.ЗапросКТаблице(Метаданные.Документы.СтатусыВыплатыПособия, "Ссылка", НастройкиЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Объект = СоздатьДокумент();
		Объект.Страхователь = Страхователь;
		Объект.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
		Объект.ИдентификаторСообщения = ИдентификаторСообщения;
		Возврат Объект;
	КонецЕсли;
КонецФункции

Функция ФизическоеЛицоПоНомерамПроцессов(НомераПроцессов)
	Если НомераПроцессов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Шапка.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Документ.ВходящийЗапросФССДляРасчетаПособия КАК Шапка
	|ГДЕ
	|	Шапка.НомерПроцесса В(&НомераПроцессов)
	|	И Шапка.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Шапка.ФизическоеЛицо
	|ИЗ
	|	Документ.ОтветНаЗапросФССДляРасчетаПособия КАК Шапка
	|ГДЕ
	|	Шапка.НомерПроцесса В(&НомераПроцессов)
	|	И Шапка.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("НомераПроцессов", НомераПроцессов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФизическоеЛицо;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ФизическоеЛицоПоИдентификаторамРеестров(ИдентификаторыРеестров)
	Если ИдентификаторыРеестров.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Регистр.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий КАК Регистр
	|ГДЕ
	|	Регистр.РегистрацияНомерРеестра В(&ИдентификаторыРеестров)
	|	И Регистр.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ИдентификаторыРеестров", ИдентификаторыРеестров);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФизическоеЛицо;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ФизическиеЛица

Процедура ПриИзмененииСНИЛСФизическогоЛица(ФизическоеЛицо, СтарыйСНИЛС, НовыйСНИЛС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СтатусыВыплатыПособия.СведенияОВыплатах КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.СотрудникСНИЛС = &НовыйСНИЛС
	|	И ТабличнаяЧасть.ФизическоеЛицо <> &ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Ссылка
	|ИЗ
	|	Документ.СтатусыВыплатыПособия.СведенияОВыплатах КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.ФизическоеЛицо = &ФизическоеЛицо
	|	И ТабличнаяЧасть.СотрудникСНИЛС <> &НовыйСНИЛС";
	Если ЗначениеЗаполнено(НовыйСНИЛС) Тогда
		Запрос.УстановитьПараметр("НовыйСНИЛС", НовыйСНИЛС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧасть.СотрудникСНИЛС = &НовыйСНИЛС", "ЛОЖЬ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧасть.СотрудникСНИЛС <> &НовыйСНИЛС", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаВыборки Из Таблица Цикл
		Если Не ЗначениеЗаполнено(СтрокаВыборки.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ЕстьИзменения = Ложь;
		ДокументОбъект = СтрокаВыборки.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТаблицы Из ДокументОбъект.СведенияОВыплатах Цикл
			Если ДокументОбъект.СотрудникСНИЛС = НовыйСНИЛС И ЗначениеЗаполнено(НовыйСНИЛС) Тогда
				ДокументОбъект.ФизическоеЛицо = ФизическоеЛицо;
			ИначеЕсли ДокументОбъект.ФизическоеЛицо = ФизическоеЛицо И ДокументОбъект.СотрудникСНИЛС <> НовыйСНИЛС Тогда
				ДокументОбъект.ФизическоеЛицо = Неопределено;
			Иначе
				Продолжить;
			КонецЕсли;
			ЕстьИзменения = Истина;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			СЭДОФСС.ЗаписатьДокумент(ДокументОбъект, Истина, "БЗК", РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
